Config/Documents/НачислениеПроцентовПенейШтрафовКПолучению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеПроцентовПенейШтрафовКПолучению</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетовПоЗаймам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатитьДоНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатитьДоНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Для формирования документов "Квитанция на оплату"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыРасчетовПоЗаймам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатитьДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасчетов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Comment>Идентификатор строки - для связи с документами "Квитанция на оплату"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/ВидыРасчетовПоЗаймам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРасчетовПоЗаймам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штрафы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениНаОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениНаПроценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьРазмещенияЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеОтНоминала</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/НачислениеПроцентовПенейШтрафовКПолучению/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоГрафикам(ДокументОбъект) Экспорт
	
	ДокументОбъект.Начисления.Очистить();
	
	ВалютаРегламентированногоУчета = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	
	Отбор = Новый Структура;
	Отбор.Вставить("СчетРасчетов", БухгалтерскийУчет.СписокСчетов("205.00,209.00",
		ДокументОбъект.Дата,, ДокументОбъект.Организация));
	Если ЗначениеЗаполнено(ДокументОбъект.ВидРасчетов) Тогда
		Отбор.Вставить("ВидРасчетов", ДокументОбъект.ВидРасчетов);
	Иначе // Все, кроме основного долга.
		ПроцентыПениШтрафы = Новый Массив;
		ПроцентыПениШтрафы.Добавить(Перечисления.ВидыРасчетовПоЗаймам.Проценты);
		ПроцентыПениШтрафы.Добавить(Перечисления.ВидыРасчетовПоЗаймам.ПениНаОсновнойДолг);
		ПроцентыПениШтрафы.Добавить(Перечисления.ВидыРасчетовПоЗаймам.ПениНаПроценты);
		ПроцентыПениШтрафы.Добавить(Перечисления.ВидыРасчетовПоЗаймам.Штрафы);
		Отбор.Вставить("ВидРасчетов", ПроцентыПениШтрафы);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(ДокументОбъект.ИФО) Тогда
		Отбор.Вставить("ИФО", ДокументОбъект.ИФО);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.КФО) Тогда
		Отбор.Вставить("КФО", ДокументОбъект.КФО);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		Отбор.Вставить("Контрагент", ДокументОбъект.Контрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.Договор) Тогда
		Отбор.Вставить("Договор", ДокументОбъект.Договор);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.ОплатитьДоНеРанее) Тогда
		Отбор.Вставить("ОплатитьДоНеРанее", НачалоДня(ДокументОбъект.ОплатитьДоНеРанее));
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.ОплатитьДоНеПозднее) Тогда
		Отбор.Вставить("ОплатитьДоНеПозднее", КонецДня(ДокументОбъект.ОплатитьДоНеПозднее));
	КонецЕсли;
	
	ПроцентыПениШтрафыКПолучению = КонтрольИсполненияДоговоров.НеисполненныеПлатежиОтПокупателейДебиторов(
		Отбор, ДокументОбъект.Организация,
		Новый Граница(КонецДня(ДокументОбъект.Дата), ВидГраницы.Включая));
	
	ТаблицаНачисленныхПроцентов = НачисленныеПроцентыПениШтрафыКПолучению(ДокументОбъект);
	ИндексПоиска = "СчетРасчетов,ИФО,КФО,КПС,КЭК,Контрагент,Договор,Валюта,ВидРасчетов";
	ТаблицаНачисленныхПроцентов.Индексы.Добавить(ИндексПоиска);
	
	Для Каждого СтрокаКПолучению Из ПроцентыПениШтрафыКПолучению Цикл
		
		// Контроль повторного начисления процентов, пеней, штрафов за указанный период.
		ПараметрыОтбора = Новый Структура(ИндексПоиска);
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаКПолучению);
		Если ТаблицаНачисленныхПроцентов.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		// Заполним начисления процентов, пеней, штрафов к получению по данным графиков.
		НоваяСтрока = ДокументОбъект.Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКПолучению,
			"Контрагент,Договор,СчетРасчетов,ВидРасчетов,Валюта,КФО,КПС,ОплатитьДо");
		
		НоваяСтрока.КЭКДоходов = СтрокаКПолучению.КЭК;
		
		Если НоваяСтрока.Валюта = ВалютаРегламентированногоУчета Тогда
			НоваяСтрока.СуммаВал  = СтрокаКПолучению.Сумма;
			НоваяСтрока.Сумма     = СтрокаКПолучению.Сумма;
			НоваяСтрока.Курс      = 1;
			НоваяСтрока.Кратность = 1;
		Иначе
			// В графике суммы в валюте платежа. Рублевую сумму по умолчанию рассчитаем по курсу ЦБ на дату начисления.
			КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НоваяСтрока.Валюта, ДокументОбъект.Дата);
			НоваяСтрока.Курс      = КурсВалюты.Курс;
			НоваяСтрока.Кратность = КурсВалюты.Кратность;
			НоваяСтрока.СуммаВал  = СтрокаКПолучению.Сумма;
			НоваяСтрока.Сумма     = Окр(НоваяСтрока.СуммаВал * НоваяСтрока.Курс /
				?(НоваяСтрока.Кратность = 0, 1, НоваяСтрока.Кратность), 2);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НачисленныеПроцентыПениШтрафыКПолучению(ДокументОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕПСБУДвиженияССубконто.СчетДт КАК СчетРасчетов,
	|	ЕПСБУДвиженияССубконто.ИФО КАК ИФО,
	|	ЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЕПСБУДвиженияССубконто.КПСДт КАК КПС,
	|	ЕПСБУДвиженияССубконто.КЭККт КАК КЭК,
	|	ЕСТЬNULL(ЕПСБУДвиженияССубконто.ВалютаДт, &ВалютаРеглУчета) КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕПСБУДвиженияССубконто.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.Контрагенты)
	|		КОГДА ЕПСБУДвиженияССубконто.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.Контрагенты)
	|		КОГДА ЕПСБУДвиженияССубконто.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.Контрагенты)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЕПСБУДвиженияССубконто.СубконтоДт1 ССЫЛКА Справочник.Договоры
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.Договоры)
	|		КОГДА ЕПСБУДвиженияССубконто.СубконтоДт2 ССЫЛКА Справочник.Договоры
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.Договоры)
	|		КОГДА ЕПСБУДвиженияССубконто.СубконтоДт3 ССЫЛКА Справочник.Договоры
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.Договоры)
	|	КОНЕЦ КАК Договор,
	|	ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.ХарактеристикаДвиженияДт КАК Перечисление.ВидыРасчетовПоЗаймам) КАК ВидРасчетов,
	|	ЕПСБУДвиженияССубконто.Сумма КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			СчетДт В (&СчетДт)
	|				И СчетКт В (&СчетКт)
	|				И Организация = &Организация
	|				И &УсловиеИФО
	|				И Активность = ИСТИНА
	|				И Регистратор <> &Регистратор,
	|			,
	|			) КАК ЕПСБУДвиженияССубконто";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Регистратор",   ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация",   ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДокументОбъект.ОплатитьДоНеРанее));
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ДокументОбъект.ОплатитьДоНеПозднее));
	Запрос.УстановитьПараметр("СчетДт", БухгалтерскийУчет.СписокСчетов("205.00,209.00"));
	Запрос.УстановитьПараметр("СчетКт", БухгалтерскийУчет.СписокСчетов("401.10"));
	Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(ДокументОбъект.ИФО) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИФО = &ИФО");
		Запрос.УстановитьПараметр("ИФО", ДокументОбъект.ИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "Истина");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
